Домашние инвестиции/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Домашние инвестиции/src/InformationRegisters/КурсыВалют/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

// Записать курс валюты.
// 
// Параметры:
//  ДатаКурса Дата курса
//  Валюта Валюта
//  Курс Курс
//  Кратность Кратность
Процедура ЗаписатьКурсВалюты(ДатаКурса, Валюта, Курс, Кратность) Экспорт
	
	Попытка
			
		Запись = СоздатьМенеджерЗаписи();
		Запись.Валюта		= Валюта;
		Запись.Период = ДатаКурса;
		Запись.Курс = Курс;
		Запись.Кратность = Кратность;
		Запись.Записать();
		
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось записать курс валюты " + Валюта + " на дату " + ДатаКурса + " по причине: " + ОписаниеОшибки();
	КонецПопытки;

	
КонецПроцедуры

// Записать таблицу курсов.
// 
// Параметры:
//  ТаблицаКурсов - таблица значений с колонками: Период, Валюта, Цена, Кратность
Процедура ЗаписатьТаблицуКурсов(Знач ТаблицаКурсов) Экспорт
	
	Для Каждого СтрокаКурса Из ТаблицаКурсов Цикл
		ЗаписатьКурсВалюты(СтрокаКурса.Период, СтрокаКурса.Валюта, СтрокаКурса.Цена, СтрокаКурса.Кратность);
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
